Repository: richardemmanuelabela/bloompy_plugins
Catalog: booknetic-mollie-connect/languages/booknetic-mollie-connect-*.po
Languages: nl_nl

source: Go to Mollie Dashboard
nl_nl: Ga naar het Mollie-dashboard

source: Your Mollie account is fully verified!
nl_nl: Je Mollie-account is volledig geverifieerd!

source: No further action is needed.
nl_nl: Er is geen verdere actie nodig.

source: Verified
nl_nl: Geverifieerd

source: Platform fee
nl_nl: Bloompy fee per payment

source: Revoke Connection
nl_nl: Verbreek verbinding

source: Not activated
nl_nl: Niet geactiveerd

source: Connect your Mollie Account
nl_nl: Koppel je Mollie account

source: Bloompy fee per payment
nl_nl: Bloompy fee per betaling

source: Click the button to start the registration process for Mollie Connect
nl_nl: Klik op de koppelknop om Mollie te koppelen

source: By clicking the register button you agree to our
nl_nl: Met het klikken op de koppelknop ga je akkoord met de

source: terms and services
nl_nl: algemene voorwaarden

source: Register
nl_nl: Koppel

source: Platform Fee
nl_nl: Bloompy Fee

source: Terms and Conditions Page URL
nl_nl: URL van de pagina met algemene voorwaarden

source: Fee cannot be less than 0
nl_nl: De vergoeding mag niet minder zijn dan 0

source: Fee cannot be higher than 100%
nl_nl: De vergoeding mag niet hoger zijn dan 100%

source: Please, fill all fields to enable Mollie Connect payment gateway.
nl_nl: Vul alle velden in om Mollie Connect als betaalmethode te activeren.

source: Platform Fee - Mollie Connect
nl_nl: Platformvergoeding - Mollie Connect

source: Use fixed amount? Enter 1 for yes.
nl_nl: Vast bedrag gebruiken? Voer 1 in voor ja.

source: Mollie Connect integration
nl_nl: Mollie Connect-integratie

source: Mollie Connect settings
nl_nl: Mollie Connect-instellingen

source: Mollie Payment
nl_nl: Mollie-betaling

source: Couldn't create a payment!
nl_nl: Betaling kon niet worden aangemaakt!
