Repository: richardemmanuelabela/bloompy_plugins
Catalog: bloomply_plugins/bloompy-woocommerce-bridge/languages/bloompy-woocommerce-bridge-*.po
Languages: nl_nl

source: Purchase Information Not Found
nl_nl: Aankoopinformatie niet gevonden

source: Account Setup In Progress
nl_nl: Accountinstelling bezig

source: Your account is being set up. Please refresh the page in a moment.
nl_nl: Uw account wordt ingesteld. Vernieuw de pagina over een moment.

source: Unable to retrieve your purchase details. Please contact support if you need assistance.
nl_nl: Kan uw aankoopgegevens niet ophalen. Neem contact op met support als u hulp nodig heeft.

source: Go to Dashboard
nl_nl: Ga naar dashboard

source: Order Not Found
nl_nl: Bestelling niet gevonden

source: Unable to retrieve your order details. Please contact support if you need assistance.
nl_nl: Kan uw bestelgegevens niet ophalen. Neem contact op met support als u hulp nodig heeft.

source: Account Not Found
nl_nl: Account niet gevonden

source: Unable to retrieve your account details. Please contact support if you need assistance.
nl_nl: Kan uw accountgegevens niet ophalen. Neem contact op met support als u hulp nodig heeft.

source: Thank You!
nl_nl: Bedankt!

source: Your purchase has been completed successfully. Your new plan is now active!
nl_nl: Uw aankoop is succesvol voltooid. Uw nieuwe abonnement is nu actief!

source: Order Details
nl_nl: Bestelgegevens

source: Order Number:
nl_nl: Bestelnummer:

source: Order Date:
nl_nl: Besteldatum:

source: Total Amount:
nl_nl: Totaalbedrag:

source: Payment Status:
nl_nl: Betaalstatus:

source: Your New Plan
nl_nl: Uw nieuwe abonnement

source: Plan Name:
nl_nl: Abonnementsnaam:

source: Description:
nl_nl: Omschrijving:

source: Plan Expires:
nl_nl: Abonnement verloopt:

source: No expiration
nl_nl: Geen vervaldatum

source: Active
nl_nl: Actief

source: What's Next?
nl_nl: Wat nu?

source: Your new plan features are now available in your Booknetic dashboard
nl_nl: De functies van uw nieuwe abonnement zijn nu beschikbaar in uw Booknetic-dashboard

source: You can start using all the features included in your plan immediately
nl_nl: U kunt direct alle functies gebruiken die in uw abonnement zijn inbegrepen

source: Check your email for a confirmation of your purchase
nl_nl: Controleer uw e-mail voor een bevestiging van uw aankoop

source: If you have any questions, please contact our support team
nl_nl: Als u vragen heeft, neem dan contact op met ons supportteam

source: Manage Plan
nl_nl: Abonnement beheren

source: Need help? Contact our support team
nl_nl: Hulp nodig? Neem contact op met ons supportteam

source: WooCommerce Bridge Settings
nl_nl: WooCommerce Bridge Instellingen

source: This plugin integrates WooCommerce with Booknetic SaaS for plan assignment and upgrades.
nl_nl: Deze plugin integreert WooCommerce met Booknetic SaaS voor abonnementsbeheer en upgrades.

source: Features:
nl_nl: Functies:

source: Automatic plan assignment based on WooCommerce orders and subscriptions
nl_nl: Automatische abonnementsbeheer op basis van WooCommerce bestellingen en abonnementen

source: Product meta box for associating Booknetic plans
nl_nl: Product meta box voor het koppelen van Booknetic abonnementen

source: Customized checkout flow for SaaS plans
nl_nl: Aangepaste checkout flow voor SaaS abonnementen

source: Post-purchase redirects to Booknetic admin
nl_nl: Na aankoop doorverwijzing naar Booknetic admin

source: Plan Upgrades
nl_nl: Abonnement Upgrades

source: Current Plan
nl_nl: Huidig Abonnement

source: Pay Period
nl_nl: Betaalperiode

source: Expiration Date
nl_nl: Vervaldatum

source: Expires:
nl_nl: Verloopt:

source: No expiration date
nl_nl: Geen vervaldatum

source: ACTIVE
nl_nl: ACTIEF

source: No plan currently assigned.
nl_nl: Geen abonnement momenteel toegewezen.

source: Plan Features & Usage
nl_nl: Abonnement Functies & Gebruik

source: Available Upgrades
nl_nl: Beschikbare Upgrades

source: Select Plan Option:
nl_nl: Selecteer Abonnement Optie:

source: -- Choose an option --
nl_nl: -- Kies een optie --

source: Subscribe
nl_nl: Abonneren

source: Subscribe Now
nl_nl: Nu Abonneren

source: No upgrade options available at the moment.
nl_nl: Geen upgrade opties beschikbaar op dit moment.

source: Please contact support for more information.
nl_nl: Neem contact op met support voor meer informatie.

source: How it works
nl_nl: Hoe het werkt

source: Select a plan option above to upgrade your current subscription
nl_nl: Selecteer een abonnement optie hierboven om uw huidige abonnement te upgraden

source: You'll be redirected to WooCommerce to complete the purchase
nl_nl: U wordt doorgestuurd naar WooCommerce om de aankoop te voltooien

source: Your new plan will be activated immediately after payment
nl_nl: Uw nieuwe abonnement wordt direct na betaling geactiveerd

source: For plans with multiple options, choose the variation that best fits your needs
nl_nl: Voor abonnementen met meerdere opties, kies de variatie die het beste bij uw behoeften past

source: Please select a plan option first.
nl_nl: Selecteer eerst een abonnement optie.

source: Are you sure you want to subscribe to
nl_nl: Weet u zeker dat u zich wilt abonneren op

source: Staff Members
nl_nl: Medewerkers

source: Services
nl_nl: Diensten

source: Locations
nl_nl: Locaties

source: Appointments
nl_nl: Afspraken

source: Customers
nl_nl: Klanten
